mymy49/yss/src/targets/st/instace/instance_uart_stm32f0_f4_f7_g4.cpp
////////////////////////////////////////////////////////////////////////////////////////
//
// 저작권 표기 License V3.3
//
// 본 소스 코드는 아래 사항에 동의할 경우에 사용 가능합니다.
// 아래 사항에 대해 동의하지 않거나 이해하지 못했을 경우 사용을 금합니다.
//
// 본 소스 코드를 :
//		- 사용하였다면 아래 사항을 모두 동의하는 것으로 자동 간주 합니다.
//		- 상업적 또는 비 상업적 이용이 가능합니다.
//		- 본 저작권 표시 주석을 제외한 코드의 내용을 임의로 수정하여 사용하는 것은 허용합니다.
//		- 사용자가 수정한 코드를 사용자의 고객사에게 상호간 전달은 허용합니다.
//		- 그러나 수정하여 다수에게 재배포하는 행위를 금지합니다. 
//		- 사용으로 인해 발생하는 모든 사고에 대해서 어떠한 법적 책임을 지지 않습니다.
//		- 어떤 형태의 기여든지, 그것은 기증으로 받아들입니다.
//
// 본 소스 코드는 프리웨어로 앞으로도 유료로 전환하지 않을 것입니다.
// 사용자 또는 부품의 제조사가 요구하는 업데이트가 있을 경우 후원금을 받아 
// 요구하는 사항을 업데이트 할 예정입니다.
//
// Home Page : http://cafe.naver.com/yssoperatingsystem
// Copyright 2024. 홍윤기 all right reserved.
//
////////////////////////////////////////////////////////////////////////////////////////

#include <drv/mcu.h>

#if defined(STM32F4) || defined(STM32F030xC) || defined(STM32F7) || defined(STM32G4)

#include <yss/instance.h>
#include <yss.h>
#include <config.h>
#include <yss/reg.h>
#include <targets/st/bitfield.h>

#if defined(STM32F4) || defined(STM32F7)
#define YSS_USART1_IRQHandler		USART1_IRQHandler
#define YSS_USART2_IRQHandler		USART2_IRQHandler
#define YSS_USART3_IRQHandler		USART3_IRQHandler
#define YSS_UART4_IRQHandler		UART4_IRQHandler
#define YSS_UART5_IRQHandler		UART5_IRQHandler
#define YSS_USART6_IRQHandler		USART6_IRQHandler
#define YSS_UART7_IRQHandler		UART7_IRQHandler
#define YSS_UART8_IRQHandler		UART8_IRQHandler
#elif defined(STM32F030xC)
#define YSS_USART1_IRQHandler		USART1_IRQHandler
#define YSS_USART2_IRQHandler		USART2_IRQHandler
#define YSS_USART3_6_IRQHandler		USART3_6_IRQHandler
#endif

using namespace define::dma;
#if defined(STM32G4)
using namespace define::dmamux;
#endif

#if USART2_ENABLE || USART3_ENABLE || USART4_ENABLE || UART4_ENABLE || USART5_ENABLE || UART5_ENABLE || UART7_ENABLE || UART8_ENABLE
static uint32_t getApb1ClockFrequency(void)
{
	return clock.getApb1ClockFrequency();
}
#endif

#if USART1_ENABLE || USART6_ENABLE
static uint32_t getApb2ClockFrequency(void)
{
	return clock.getApb2ClockFrequency();
}
#endif

#if defined(USART1) && USART1_ENABLE
static void enableUart1Clock(bool en)
{
	clock.lock();
	clock.enableApb2Clock(RCC_APB2ENR_USART1EN_Pos, en);
	clock.unlock();
}

static void enableUart1Interrupt(bool en)
{
	nvic.lock();
	nvic.enableInterrupt(USART1_IRQn, en);
	nvic.unlock();
}

static void resetUart1(void)
{
	clock.lock();
	clock.resetApb2(RCC_APB2RSTR_USART1RST_Pos);
	clock.unlock();
}

static const Drv::setup_t gDrvUart1Setup
{
	enableUart1Clock,		//void (*clockFunc)(bool en);
	enableUart1Interrupt,	//void (*nvicFunc)(bool en);
	resetUart1,				//void (*resetFunc)(void);
	getApb2ClockFrequency	//uint32_t (*getClockFunc)(void);
};

static const Dma::DmaInfo gUart1TxDmaInfo = 
{
#if defined(STM32F030xC)
	(define::dma::priorityLevel::LOW << DMA_CCR_PL_Pos) | // uint32_t controlRegister1
	(define::dma::size::BYTE << DMA_CCR_MSIZE_Pos) |
	(define::dma::size::BYTE << DMA_CCR_PSIZE_Pos) |
	DMA_CCR_MINC_Msk | 
	(define::dma::dir::MEM_TO_PERI << DMA_CCR_DIR_Pos) | 
	DMA_CCR_TCIE_Msk | 
	DMA_CCR_TEIE_Msk | 
	DMA_CCR_EN_Msk ,
#if (USART1_DMA_TX == DMA_CH2)
	0x0F << (4 * 1),									// uint32_t controlRegister2
	0x08 << (4 * 1),									// uint32_t controlRegister3
#elif (USART1_DMA_TX == DMA_CH4)
	0x0F << (4 * 3),									// uint32_t controlRegister2
	0x08 << (4 * 3),									// uint32_t controlRegister3
#endif
	(void*)&USART1->TDR,								//void *dataRegister;
#elif defined(STM32G4)
	(priorityLevel::LOW << DMA_CCR_PL_Pos) |		// uint32_t ccr;
	(size::BYTE << DMA_CCR_MSIZE_Pos) |
	(size::BYTE << DMA_CCR_PSIZE_Pos) |
	DMA_CCR_MINC_Msk | 
	(dir::MEM_TO_PERI << DMA_CCR_DIR_Pos) | 
	DMA_CCR_TCIE_Msk | 
	DMA_CCR_TEIE_Msk,
	input::USART1_TX << DMAMUX_CxCR_DMAREQ_ID_Pos,	// uint32_t muxccr;
	(void*)&USART1->TDR								// void *cpar;
#else
	(define::dma2::stream7::USART1_TX << DMA_SxCR_CHSEL_Pos) |	// uint32_t controlRegister1
	(define::dma::burst::SINGLE << DMA_SxCR_MBURST_Pos) | 
	(define::dma::burst::SINGLE << DMA_SxCR_PBURST_Pos) | 
	(define::dma::priorityLevel::LOW << DMA_SxCR_PL_Pos) |
	(define::dma::size::BYTE << DMA_SxCR_MSIZE_Pos) |
	(define::dma::size::BYTE << DMA_SxCR_PSIZE_Pos) |
	DMA_SxCR_MINC_Msk | 
	(define::dma::dir::MEM_TO_PERI << DMA_SxCR_DIR_Pos) | 
	DMA_SxCR_TCIE_Msk | 
	DMA_SxCR_TEIE_Msk | 
	DMA_SxCR_EN_Msk ,
	DMA_SxFCR_DMDIS_Msk,			// uint32_t controlRegister2
	0,								// uint32_t controlRegister3
#if defined(STM32F7)
	(void*)&USART1->TDR,	//void *dataRegister;
#else
	(void*)&USART1->DR,					//void *dataRegister;
#endif
#endif
};

#if defined(STM32G4)
static const Dma::DmaInfo gUart1RxDmaInfo = 
{
	(define::dma::priorityLevel::LOW << DMA_CCR_PL_Pos) |			// uint32_t ccr;
	(define::dma::size::BYTE << DMA_CCR_MSIZE_Pos) |
	(define::dma::size::BYTE << DMA_CCR_PSIZE_Pos) |
	DMA_CCR_MINC_Msk | 
	(define::dma::dir::PERI_TO_MEM << DMA_CCR_DIR_Pos) | 
	DMA_CCR_CIRC_Msk,
	define::dmamux::input::USART1_RX << DMAMUX_CxCR_DMAREQ_ID_Pos,	// uint32_t muxccr;
	(void*)&USART1->RDR												// void *cpar;
};
#endif

static const Uart::setup_t gUart1Setup
{
#if defined(STM32F030xC)
	USART1,	//YSS_USART_Typedef *peri;
#if (USART1_DMA_TX == DMA_CH2)
	dmaChannel2,				//Dma &txDma;
#elif (USART1_DMA_TX == DMA_CH4)
	dmaChannel4,				//Dma &txDma;
	gUart1TxDmaInfo				//Dma::DmaInfo txDmaInfo;
#endif
#elif defined(STM32G4)
	(YSS_USART_Typedef*)USART1,	//YSS_USART_Typedef *peri;
	gUart1TxDmaInfo,			//Dma::DmaInfo txDmaInfo;
	gUart1RxDmaInfo,			//Dma::DmaInfo txDmaInfo;
#else
	USART1,	//YSS_USART_Typedef *peri;
	dmaChannel16,				//Dma &txDma;
	gUart1TxDmaInfo,			//Dma::DmaInfo txDmaInfo;
#endif
};

Usart usart1(gDrvUart1Setup, gUart1Setup);

extern "C"
{
	void USART1_IRQHandler(void)
	{
		usart1.isr();
	}
}
#endif



#if defined(USART2) && USART2_ENABLE
static void enableUart2Clock(bool en)
{
	clock.lock();
#if defined(STM32G4)
	clock.enableApb1_1Clock(RCC_APB1ENR1_USART2EN_Pos, en);
#else
	clock.enableApb1Clock(RCC_APB1ENR_USART2EN_Pos, en);
#endif
	clock.unlock();
}

