mymy49/yss/src/targets/st/instace/instance_uart_stm32f0_f4_f7_g4.cpp
static void enableUart2Interrupt(bool en)
{
	nvic.lock();
	nvic.enableInterrupt(USART2_IRQn, en);
	nvic.unlock();
}

static void resetUart2(void)
{
	clock.lock();
#if defined(STM32G4)
	clock.resetApb1_1(RCC_APB1RSTR1_USART2RST_Pos);
#else
	clock.resetApb1(RCC_APB1RSTR_USART2RST_Pos);
#endif
	clock.unlock();
}

static const Drv::setup_t gDrvUart2Setup= 
{
	enableUart2Clock,		//void (*clockFunc)(bool en);
	enableUart2Interrupt,	//void (*nvicFunc)(bool en);
	resetUart2,				//void (*resetFunc)(void);
	getApb1ClockFrequency	//uint32_t (*getClockFunc)(void);
};

static const Dma::DmaInfo gUart2TxDmaInfo = 
{
#if defined(STM32F030xC)
	(define::dma::priorityLevel::LOW << DMA_CCR_PL_Pos) | // uint32_t controlRegister1
	(define::dma::size::BYTE << DMA_CCR_MSIZE_Pos) |
	(define::dma::size::BYTE << DMA_CCR_PSIZE_Pos) |
	DMA_CCR_MINC_Msk | 
	(define::dma::dir::MEM_TO_PERI << DMA_CCR_DIR_Pos) | 
	DMA_CCR_TCIE_Msk | 
	DMA_CCR_TEIE_Msk | 
	DMA_CCR_EN_Msk ,
#if (USART2_DMA_TX == DMA_CH2)
	0x0F << (4 * 1),									// uint32_t controlRegister2
	0x09 << (4 * 1),									// uint32_t controlRegister3
#elif (USART2_DMA_TX == DMA_CH4)
	0x0F << (4 * 3),									// uint32_t controlRegister2
	0x09 << (4 * 3),									// uint32_t controlRegister3
#endif
	(void*)&USART2->TDR,								// void *dataRegister;
#elif defined(STM32G4)
	(define::dma::priorityLevel::LOW << DMA_CCR_PL_Pos) |			// uint32_t ccr;
	(define::dma::size::BYTE << DMA_CCR_MSIZE_Pos) |
	(define::dma::size::BYTE << DMA_CCR_PSIZE_Pos) |
	DMA_CCR_MINC_Msk | 
	(define::dma::dir::MEM_TO_PERI << DMA_CCR_DIR_Pos) | 
	DMA_CCR_TCIE_Msk | 
	DMA_CCR_TEIE_Msk,
	define::dmamux::input::USART2_TX << DMAMUX_CxCR_DMAREQ_ID_Pos,	// uint32_t muxccr;
	(void*)&USART2->TDR												// void *cpar;
#else
	(define::dma1::stream6::USART2_TX << DMA_SxCR_CHSEL_Pos) |	// uint32_t controlRegister1
	(define::dma::burst::SINGLE << DMA_SxCR_MBURST_Pos) | 
	(define::dma::burst::SINGLE << DMA_SxCR_PBURST_Pos) | 
	(define::dma::priorityLevel::LOW << DMA_SxCR_PL_Pos) |
	(define::dma::size::BYTE << DMA_SxCR_MSIZE_Pos) |
	(define::dma::size::BYTE << DMA_SxCR_PSIZE_Pos) |
	DMA_SxCR_MINC_Msk | 
	(define::dma::dir::MEM_TO_PERI << DMA_SxCR_DIR_Pos) | 
	DMA_SxCR_TCIE_Msk | 
	DMA_SxCR_TEIE_Msk | 
	DMA_SxCR_EN_Msk ,
	DMA_SxFCR_DMDIS_Msk,		// uint32_t controlRegister2
	0,							// uint32_t controlRegister3
#if defined(STM32F7)
	(void*)&USART2->TDR,		//void *dataRegister;
#else
	(void*)&USART2->DR,			//void *dataRegister;
#endif
#endif
};

#if defined(STM32G4)
static const Dma::DmaInfo gUart2RxDmaInfo = 
{
	(define::dma::priorityLevel::LOW << DMA_CCR_PL_Pos) |			// uint32_t ccr;
	(define::dma::size::BYTE << DMA_CCR_MSIZE_Pos) |
	(define::dma::size::BYTE << DMA_CCR_PSIZE_Pos) |
	DMA_CCR_MINC_Msk | 
	(define::dma::dir::PERI_TO_MEM << DMA_CCR_DIR_Pos) | 
	DMA_CCR_CIRC_Msk,
	define::dmamux::input::USART2_RX << DMAMUX_CxCR_DMAREQ_ID_Pos,	// uint32_t muxccr;
	(void*)&USART2->RDR												// void *cpar;
};
#endif

static const Uart::setup_t gUart2Setup = 
{
#if defined(STM32F030xC)
	(YSS_USART_Typedef*)USART2,	//YSS_USART_Typedef *peri;
#if (USART2_DMA_TX == DMA_CH2)
	dmaChannel2,				//Dma &txDma;
	gUart2TxDmaInfo				//Dma::DmaInfo txDmaInfo;
#elif (USART2_DMA_TX == DMA_CH4)
	dmaChannel4,				//Dma &txDma;
	gUart2TxDmaInfo				//Dma::DmaInfo txDmaInfo;
#endif
#elif defined(STM32G4)
	(YSS_USART_Typedef*)USART2,	//YSS_USART_Typedef *peri;
	gUart2TxDmaInfo,			//Dma::DmaInfo txDmaInfo;
	gUart2RxDmaInfo				//Dma::DmaInfo txDmaInfo;
#else
	(YSS_USART_Typedef*)USART2,	//YSS_USART_Typedef *peri;
	dmaChannel7,				//Dma &txDma;
	gUart2TxDmaInfo				//Dma::DmaInfo txDmaInfo;
#endif
};

Usart usart2(gDrvUart2Setup, gUart2Setup);

extern "C"
{
	void USART2_IRQHandler(void)
	{
		usart2.isr();
	}
}
#endif

#if defined(USART3) && USART3_ENABLE
static void enableUart3Clock(bool en)
{
	clock.lock();
#if defined(STM32G4)
	clock.enableApb1_1Clock(RCC_APB1ENR1_USART3EN_Pos, en);
#else
	clock.enableApb1Clock(RCC_APB1ENR_USART3EN_Pos, en);
#endif
	clock.unlock();
}

static void enableUart3Interrupt(bool en)
{
	nvic.lock();
#if defined(STM32F030xC)
	nvic.enableInterrupt(USART3_6_IRQn, en);
#else
	nvic.enableInterrupt(USART3_IRQn, en);
#endif
	nvic.unlock();
}

static void resetUart3(void)
{
	clock.lock();
#if defined(STM32G4)
	clock.resetApb1_1(RCC_APB1RSTR1_USART3RST_Pos);
#else
	clock.resetApb1(RCC_APB1RSTR_USART3RST_Pos);
#endif
	clock.unlock();
}

static const Drv::setup_t gDrvUart3Setup
{
	enableUart3Clock,		//void (*clockFunc)(bool en);
	enableUart3Interrupt,	//void (*nvicFunc)(bool en);
	resetUart3,				//void (*resetFunc)(void);
	getApb1ClockFrequency	//uint32_t (*getClockFunc)(void);
};

static const Dma::DmaInfo gUart3TxDmaInfo = 
{
#if defined(STM32F030xC)
	(define::dma::priorityLevel::LOW << DMA_CCR_PL_Pos) | // uint32_t controlRegister1
	(define::dma::size::BYTE << DMA_CCR_MSIZE_Pos) |
	(define::dma::size::BYTE << DMA_CCR_PSIZE_Pos) |
	DMA_CCR_MINC_Msk | 
	(define::dma::dir::MEM_TO_PERI << DMA_CCR_DIR_Pos) | 
	DMA_CCR_TCIE_Msk | 
	DMA_CCR_TEIE_Msk | 
	DMA_CCR_EN_Msk ,
#if (USART3_DMA_TX == DMA_CH2)
	0x0F << (4 * 1),									// uint32_t controlRegister2
	0x0A << (4 * 1),									// uint32_t controlRegister3
#elif (USART3_DMA_TX == DMA_CH4)
	0x0F << (4 * 3),									// uint32_t controlRegister2
	0x0A << (4 * 3),									// uint32_t controlRegister3
#endif
	(void*)&USART3->TDR,								//void *dataRegister;
#elif defined(STM32G4)
	(define::dma::priorityLevel::LOW << DMA_CCR_PL_Pos) |			// uint32_t ccr;
	(define::dma::size::BYTE << DMA_CCR_MSIZE_Pos) |
	(define::dma::size::BYTE << DMA_CCR_PSIZE_Pos) |
	DMA_CCR_MINC_Msk | 
	(define::dma::dir::MEM_TO_PERI << DMA_CCR_DIR_Pos) | 
	DMA_CCR_TCIE_Msk | 
	DMA_CCR_TEIE_Msk,
	define::dmamux::input::USART3_TX << DMAMUX_CxCR_DMAREQ_ID_Pos,	// uint32_t muxccr;
	(void*)&USART3->TDR												// void *cpar;
#else
	(define::dma1::stream3::USART3_TX << DMA_SxCR_CHSEL_Pos) |	// uint32_t controlRegister1
	(define::dma::burst::SINGLE << DMA_SxCR_MBURST_Pos) | 
	(define::dma::burst::SINGLE << DMA_SxCR_PBURST_Pos) | 
	(define::dma::priorityLevel::LOW << DMA_SxCR_PL_Pos) |
	(define::dma::size::BYTE << DMA_SxCR_MSIZE_Pos) |
	(define::dma::size::BYTE << DMA_SxCR_PSIZE_Pos) |
	DMA_SxCR_MINC_Msk | 
	(define::dma::dir::MEM_TO_PERI << DMA_SxCR_DIR_Pos) | 
	DMA_SxCR_TCIE_Msk | 
	DMA_SxCR_TEIE_Msk | 
	DMA_SxCR_EN_Msk ,
	DMA_SxFCR_DMDIS_Msk,			// uint32_t controlRegister2
	0,								// uint32_t controlRegister3
#if defined(STM32F7)
	(void*)&USART3->TDR,	//void *dataRegister;
#else
	(void*)&USART3->DR,					//void *dataRegister;
#endif
#endif
};

#if defined(STM32G4)
static const Dma::DmaInfo gUart3RxDmaInfo = 
{
	(define::dma::priorityLevel::LOW << DMA_CCR_PL_Pos) |			// uint32_t ccr;
	(define::dma::size::BYTE << DMA_CCR_MSIZE_Pos) |
	(define::dma::size::BYTE << DMA_CCR_PSIZE_Pos) |
	DMA_CCR_MINC_Msk | 
	(define::dma::dir::PERI_TO_MEM << DMA_CCR_DIR_Pos) | 
	DMA_CCR_CIRC_Msk,
	define::dmamux::input::USART3_RX << DMAMUX_CxCR_DMAREQ_ID_Pos,	// uint32_t muxccr;
	(void*)&USART3->RDR												// void *cpar;
};
#endif

static const Uart::setup_t gUart3Setup
{
#if defined(STM32F030xC)
	USART3,			//YSS_SPI_Peri *peri;
#if (USART3_DMA_TX == DMA_CH2)
	dmaChannel2,				//Dma &txDma;
#elif (USART3_DMA_TX == DMA_CH4)
	dmaChannel4,				//Dma &txDma;
	gUart3TxDmaInfo,//Dma::DmaInfo txDmaInfo;
#endif
#elif defined(STM32G4)
	(YSS_USART_Typedef*)USART3,	//YSS_USART_Typedef *peri;
	gUart3TxDmaInfo,			//Dma::DmaInfo txDmaInfo;
	gUart3RxDmaInfo				//Dma::DmaInfo txDmaInfo;
#else
	USART3,			//YSS_SPI_Peri *peri;
	dmaChannel4,	//Dma &txDma;
	gUart3TxDmaInfo,//Dma::DmaInfo txDmaInfo;
#endif
};

Usart usart3(gDrvUart3Setup, gUart3Setup);

#if !defined(STM32F030xC)
extern "C"
{
	void USART3_IRQHandler(void)
	{
		usart3.isr();
	}
}
#endif

#endif



