mymy49/yss/src/targets/st/instace/instance_uart_stm32f0_f4_f7_g4.cpp
#if (defined(UART4) || defined(USART4)) && (UART4_ENABLE || USART4_ENABLE)
static void enableUart4Clock(bool en)
{
	clock.lock();
#if defined(USART4)
	clock.enableApb1Clock(RCC_APB1ENR_USART4EN_Pos, en);
#else
#if defined(STM32G4)
	clock.enableApb1_1Clock(RCC_APB1ENR1_UART4EN_Pos, en);
#else
	clock.enableApb1Clock(RCC_APB1ENR_UART4EN_Pos, en);
#endif
#endif
	clock.unlock();
}

static void enableUart4Interrupt(bool en)
{
	nvic.lock();
#if defined(STM32F030xC)
	nvic.enableInterrupt(USART3_6_IRQn, en);
#else
	nvic.enableInterrupt(UART4_IRQn, en);
#endif
	nvic.unlock();
}

static void resetUart4(void)
{
	clock.lock();
#if defined(USART4)
	clock.resetApb1(RCC_APB1RSTR_USART4RST_Pos);
#else
#if defined(STM32G4)
	clock.resetApb1_1(RCC_APB1RSTR1_UART4RST_Pos);
#else
	clock.resetApb1(RCC_APB1RSTR_UART4RST_Pos);
#endif
#endif
	clock.unlock();
}

static const Drv::setup_t gDrvUart4Setup = 
{
	enableUart4Clock,		//void (*clockFunc)(bool en);
	enableUart4Interrupt,	//void (*nvicFunc)(bool en);
	resetUart4,				//void (*resetFunc)(void);
	getApb1ClockFrequency	//uint32_t (*getClockFunc)(void);
};

static const Dma::DmaInfo gUart4TxDmaInfo = 
{
#if defined(STM32F030xC)
	(define::dma::priorityLevel::LOW << DMA_CCR_PL_Pos) | // uint32_t controlRegister1
	(define::dma::size::BYTE << DMA_CCR_MSIZE_Pos) |
	(define::dma::size::BYTE << DMA_CCR_PSIZE_Pos) |
	DMA_CCR_MINC_Msk | 
	(define::dma::dir::MEM_TO_PERI << DMA_CCR_DIR_Pos) | 
	DMA_CCR_TCIE_Msk | 
	DMA_CCR_TEIE_Msk | 
	DMA_CCR_EN_Msk ,
#if (USART4_DMA_TX == DMA_CH2)
	0x0F << (4 * 1),									// uint32_t controlRegister2
	0x0B << (4 * 1),									// uint32_t controlRegister3
#elif (USART4_DMA_TX == DMA_CH4)
	0x0F << (4 * 3),									// uint32_t controlRegister2
	0x0B << (4 * 3),									// uint32_t controlRegister3
#endif
	(void*)&USART4->TDR,								//void *dataRegister;
#elif defined(STM32G4)
	(define::dma::priorityLevel::LOW << DMA_CCR_PL_Pos) |			// uint32_t ccr;
	(define::dma::size::BYTE << DMA_CCR_MSIZE_Pos) |
	(define::dma::size::BYTE << DMA_CCR_PSIZE_Pos) |
	DMA_CCR_MINC_Msk | 
	(define::dma::dir::MEM_TO_PERI << DMA_CCR_DIR_Pos) | 
	DMA_CCR_TCIE_Msk | 
	DMA_CCR_TEIE_Msk,
	define::dmamux::input::UART4_TX << DMAMUX_CxCR_DMAREQ_ID_Pos,	// uint32_t muxccr;
	(void*)&UART4->TDR												// void *cpar;
#else
	(define::dma1::stream4::UART4_TX << DMA_SxCR_CHSEL_Pos) |	// uint32_t controlRegister1
	(define::dma::burst::SINGLE << DMA_SxCR_MBURST_Pos) | 
	(define::dma::burst::SINGLE << DMA_SxCR_PBURST_Pos) | 
	(define::dma::priorityLevel::LOW << DMA_SxCR_PL_Pos) |
	(define::dma::size::BYTE << DMA_SxCR_MSIZE_Pos) |
	(define::dma::size::BYTE << DMA_SxCR_PSIZE_Pos) |
	DMA_SxCR_MINC_Msk | 
	(define::dma::dir::MEM_TO_PERI << DMA_SxCR_DIR_Pos) | 
	DMA_SxCR_TCIE_Msk | 
	DMA_SxCR_TEIE_Msk | 
	DMA_SxCR_EN_Msk ,
	DMA_SxFCR_DMDIS_Msk,			// uint32_t controlRegister2
	0,								// uint32_t controlRegister3
#if defined(STM32F7)
	(void*)&UART4->TDR,				//void *dataRegister;
#else
	(void*)&UART4->DR,						//void *dataRegister;
#endif
#endif
};

#if defined(STM32G4)
static const Dma::DmaInfo gUart4RxDmaInfo = 
{
	(define::dma::priorityLevel::LOW << DMA_CCR_PL_Pos) |			// uint32_t ccr;
	(define::dma::size::BYTE << DMA_CCR_MSIZE_Pos) |
	(define::dma::size::BYTE << DMA_CCR_PSIZE_Pos) |
	DMA_CCR_MINC_Msk | 
	(define::dma::dir::PERI_TO_MEM << DMA_CCR_DIR_Pos) | 
	DMA_CCR_CIRC_Msk,
	define::dmamux::input::UART4_RX << DMAMUX_CxCR_DMAREQ_ID_Pos,	// uint32_t muxccr;
	(void*)&UART4->RDR												// void *cpar;
};
#endif

static const Uart::setup_t gUart4Setup = 
{
#if defined(STM32F030xC)
	USART4,			//YSS_SPI_Peri *peri;
#if (USART4_DMA_TX == DMA_CH2)
	dmaChannel2,				//Dma &txDma;
#elif (UART4_DMA_TX == DMA_CH4)
	dmaChannel4,				//Dma &txDma;
#endif
	gUart4TxDmaInfo	//Dma::DmaInfo txDmaInfo;
#elif defined(STM32G4)
	(YSS_USART_Typedef*)UART4,	//YSS_USART_Typedef *peri;
	gUart4TxDmaInfo,			//Dma::DmaInfo txDmaInfo;
	gUart4RxDmaInfo				//Dma::DmaInfo txDmaInfo;
#else
	UART4,			//YSS_SPI_Peri *peri;
	dmaChannel5,	//Dma &txDma;
	gUart4TxDmaInfo	//Dma::DmaInfo txDmaInfo;
#endif
};

#if defined(USART4)
Usart usart4(gDrvUart4Setup, gUart4Setup);
#else
Uart uart4(gDrvUart4Setup, gUart4Setup);
#endif

#if !defined(STM32F030xC)
extern "C"
{
	void UART4_IRQHandler(void)
	{
		uart4.isr();
	}
}
#endif

#endif

#if (defined(UART5) || defined(USART5)) && (UART5_ENABLE || USART5_ENABLE)
static void enableUart5Clock(bool en)
{
	clock.lock();
#if defined(USART5)
	clock.enableApb1Clock(RCC_APB1ENR_USART5EN_Pos, en);
#else
#if defined(STM32G4)
	clock.enableApb1_1Clock(RCC_APB1ENR1_UART5EN_Pos, en);
#else
	clock.enableApb1Clock(RCC_APB1ENR_UART5EN_Pos, en);
#endif
#endif
	clock.unlock();
}

static void enableUart5Interrupt(bool en)
{
	nvic.lock();
#if defined(STM32F030xC)
	nvic.enableInterrupt(USART3_6_IRQn, en);
#else
	nvic.enableInterrupt(UART5_IRQn, en);
#endif
	nvic.unlock();
}

static void resetUart5(void)
{
	clock.lock();
#if defined(USART5)
	clock.resetApb1(RCC_APB1RSTR_USART5RST_Pos);
#else
#if defined(STM32G4)
	clock.resetApb1_1(RCC_APB1RSTR1_UART5RST_Pos);
#else
	clock.resetApb1(RCC_APB1RSTR_UART5RST_Pos);
#endif
#endif
	clock.unlock();
}

static const Drv::setup_t gDrvUart5Setup
{
	enableUart5Clock,		//void (*clockFunc)(bool en);
	enableUart5Interrupt,	//void (*nvicFunc)(bool en);
	resetUart5,				//void (*resetFunc)(void);
	getApb1ClockFrequency	//uint32_t (*getClockFunc)(void);
};

static const Dma::DmaInfo gUart5TxDmaInfo = 
{
#if defined(STM32F030xC)
	(define::dma::priorityLevel::LOW << DMA_CCR_PL_Pos) | // uint32_t controlRegister1
	(define::dma::size::BYTE << DMA_CCR_MSIZE_Pos) |
	(define::dma::size::BYTE << DMA_CCR_PSIZE_Pos) |
	DMA_CCR_MINC_Msk | 
	(define::dma::dir::MEM_TO_PERI << DMA_CCR_DIR_Pos) | 
	DMA_CCR_TCIE_Msk | 
	DMA_CCR_TEIE_Msk | 
	DMA_CCR_EN_Msk ,
#if (USART5_DMA_TX == DMA_CH2)
	0x0F << (4 * 1),									// uint32_t controlRegister2
	0x0C << (4 * 1),									// uint32_t controlRegister3
#elif (USART5_DMA_TX == DMA_CH4)
	0x0F << (4 * 3),									// uint32_t controlRegister2
	0x0C << (4 * 3),									// uint32_t controlRegister3
#endif
	(void*)&USART5->TDR,								//void *dataRegister;
#elif defined(STM32G4)
	(define::dma::priorityLevel::LOW << DMA_CCR_PL_Pos) |			// uint32_t ccr;
	(define::dma::size::BYTE << DMA_CCR_MSIZE_Pos) |
	(define::dma::size::BYTE << DMA_CCR_PSIZE_Pos) |
	DMA_CCR_MINC_Msk | 
	(define::dma::dir::MEM_TO_PERI << DMA_CCR_DIR_Pos) | 
	DMA_CCR_TCIE_Msk | 
	DMA_CCR_TEIE_Msk,
	define::dmamux::input::UART5_TX << DMAMUX_CxCR_DMAREQ_ID_Pos,	// uint32_t muxccr;
	(void*)&UART5->TDR												// void *cpar;
#else
	(define::dma1::stream7::UART5_TX << DMA_SxCR_CHSEL_Pos) |	// uint32_t controlRegister1
	(define::dma::burst::SINGLE << DMA_SxCR_MBURST_Pos) | 
	(define::dma::burst::SINGLE << DMA_SxCR_PBURST_Pos) | 
	(define::dma::priorityLevel::LOW << DMA_SxCR_PL_Pos) |
	(define::dma::size::BYTE << DMA_SxCR_MSIZE_Pos) |
	(define::dma::size::BYTE << DMA_SxCR_PSIZE_Pos) |
	DMA_SxCR_MINC_Msk | 
	(define::dma::dir::MEM_TO_PERI << DMA_SxCR_DIR_Pos) | 
	DMA_SxCR_TCIE_Msk | 
	DMA_SxCR_TEIE_Msk | 
	DMA_SxCR_EN_Msk ,
	DMA_SxFCR_DMDIS_Msk,			// uint32_t controlRegister2
	0,								// uint32_t controlRegister3
#if defined(STM32F7)
	(void*)&UART5->TDR,				//void *dataRegister;
#else
	(void*)&UART5->DR,						//void *dataRegister;
#endif
#endif
};

#if defined(STM32G4)
static const Dma::DmaInfo gUart5RxDmaInfo = 
{
	(define::dma::priorityLevel::LOW << DMA_CCR_PL_Pos) |			// uint32_t ccr;
	(define::dma::size::BYTE << DMA_CCR_MSIZE_Pos) |
	(define::dma::size::BYTE << DMA_CCR_PSIZE_Pos) |
	DMA_CCR_MINC_Msk | 
	(define::dma::dir::PERI_TO_MEM << DMA_CCR_DIR_Pos) | 
	DMA_CCR_CIRC_Msk,
	define::dmamux::input::UART5_RX << DMAMUX_CxCR_DMAREQ_ID_Pos,	// uint32_t muxccr;
	(void*)&UART5->RDR												// void *cpar;
};
#endif

static const Uart::setup_t gUart5Setup
{
#if defined(STM32F030xC)
	USART5,			//YSS_SPI_Peri *peri;
#if (USART5_DMA_TX == DMA_CH2)
	dmaChannel2,	//Dma &txDma;
#elif (USART5_DMA_TX == DMA_CH4)
	dmaChannel4,	//Dma &txDma;
	gUart5TxDmaInfo	//Dma::DmaInfo txDmaInfo;
#endif
#elif defined(STM32G4)
	(YSS_USART_Typedef*)UART4,	//YSS_USART_Typedef *peri;
	gUart5TxDmaInfo,			//Dma::DmaInfo txDmaInfo;
	gUart5RxDmaInfo				//Dma::DmaInfo txDmaInfo;
#else
	UART5,			//YSS_SPI_Peri *peri;
	dmaChannel8,	//Dma &txDma;
	gUart5TxDmaInfo	//Dma::DmaInfo txDmaInfo;
#endif
};

