mymy49/yss/src/targets/st/instace/instance_uart_stm32f0_f4_f7_g4.cpp
#if defined(STM32F030xC)
Usart usart5(gDrvUart5Setup, gUart5Setup);
#else
Uart uart5(gDrvUart5Setup, gUart5Setup);
#endif

extern "C"
{
#if !defined(STM32F030xC)
	void UART5_IRQHandler(void)
	{
		uart5.isr();
	}
#endif
}
#endif



#if defined(USART6) && USART6_ENABLE
static void enableUart6Clock(bool en)
{
	clock.lock();
	clock.enableApb2Clock(RCC_APB2ENR_USART6EN_Pos, en);
	clock.unlock();
}

static void enableUart6Interrupt(bool en)
{
	nvic.lock();
#if defined(STM32F030xC)
	nvic.enableInterrupt(USART3_6_IRQn, en);
#else
	nvic.enableInterrupt(USART6_IRQn, en);
#endif
	nvic.unlock();
}

static void resetUart6(void)
{
	clock.lock();
	clock.resetApb2(RCC_APB2RSTR_USART6RST_Pos);
	clock.unlock();
}

static const Drv::setup_t gDrvUart6Setup
{
	enableUart6Clock,		//void (*clockFunc)(bool en);
	enableUart6Interrupt,	//void (*nvicFunc)(bool en);
	resetUart6,				//void (*resetFunc)(void);
	getApb2ClockFrequency	//uint32_t (*getClockFunc)(void);
};

#if defined(STM32F030xC)
static const Dma::DmaInfo gUart6TxDmaInfo = 
{
	(define::dma::priorityLevel::LOW << DMA_CCR_PL_Pos) | // uint32_t controlRegister1
	(define::dma::size::BYTE << DMA_CCR_MSIZE_Pos) |
	(define::dma::size::BYTE << DMA_CCR_PSIZE_Pos) |
	DMA_CCR_MINC_Msk | 
	(define::dma::dir::MEM_TO_PERI << DMA_CCR_DIR_Pos) | 
	DMA_CCR_TCIE_Msk | 
	DMA_CCR_TEIE_Msk | 
	DMA_CCR_EN_Msk ,
#if (USART6_DMA_TX == DMA_CH2)
	0x0F << (4 * 1),									// uint32_t controlRegister2
	0x0D << (4 * 1),									// uint32_t controlRegister3
#elif (USART6_DMA_TX == DMA_CH4)
	0x0F << (4 * 3),									// uint32_t controlRegister2
	0x0D << (4 * 3),									// uint32_t controlRegister3
#endif
	(void*)&USART6->TDR,								//void *dataRegister;
};
#else
static const Dma::DmaInfo gUart6TxDmaInfo = 
{
	(define::dma2::stream6::USART6_TX << DMA_SxCR_CHSEL_Pos) |	// uint32_t controlRegister1
	(define::dma::burst::SINGLE << DMA_SxCR_MBURST_Pos) | 
	(define::dma::burst::SINGLE << DMA_SxCR_PBURST_Pos) | 
	(define::dma::priorityLevel::LOW << DMA_SxCR_PL_Pos) |
	(define::dma::size::BYTE << DMA_SxCR_MSIZE_Pos) |
	(define::dma::size::BYTE << DMA_SxCR_PSIZE_Pos) |
	DMA_SxCR_MINC_Msk | 
	(define::dma::dir::MEM_TO_PERI << DMA_SxCR_DIR_Pos) | 
	DMA_SxCR_TCIE_Msk | 
	DMA_SxCR_TEIE_Msk | 
	DMA_SxCR_EN_Msk ,
	DMA_SxFCR_DMDIS_Msk,			// uint32_t controlRegister2
	0,								// uint32_t controlRegister3
#if defined(STM32F7)
	(void*)&USART6->TDR,			//void *dataRegister;
#else
	(void*)&USART6->DR,						//void *dataRegister;
#endif
};
#endif

static const Uart::setup_t gUart6Setup
{
	USART6,			//YSS_SPI_Peri *peri;
#if defined(STM32F030xC)
#if (UART6_DMA_TX == DMA_CH2)
	dmaChannel2,	//Dma &txDma;
#else (UART6_DMA_TX == DMA_CH4)
	dmaChannel4,	//Dma &txDma;
#endif
#else
	dmaChannel15,	//Dma &txDma;
#endif
	gUart6TxDmaInfo	//Dma::DmaInfo txDmaInfo;
};

Usart usart6(gDrvUart6Setup, gUart6Setup);

extern "C"
{
	void USART6_IRQHandler(void)
	{
		usart6.isr();
	}
}
#endif



#if (defined(UART7) || defined(USART7)) && UART7_ENABLE
static void enableUart7Clock(bool en)
{
	clock.lock();
	clock.enableApb1Clock(RCC_APB1ENR_UART7EN_Pos, en);
	clock.unlock();
}

static void enableUart7Interrupt(bool en)
{
	nvic.lock();
	nvic.enableInterrupt(UART7_IRQn, en);
	nvic.unlock();
}

static void resetUart7(void)
{
	clock.lock();
	clock.resetApb1(RCC_APB1RSTR_UART7RST_Pos);
	clock.unlock();
}

static const Drv::setup_t gDrvUart7Setup
{
	enableUart7Clock,		//void (*clockFunc)(bool en);
	enableUart7Interrupt,	//void (*nvicFunc)(bool en);
	resetUart7,				//void (*resetFunc)(void);
	getApb1ClockFrequency	//uint32_t (*getClockFunc)(void);
};

static const Dma::DmaInfo gUart7TxDmaInfo = 
{
	(define::dma1::stream1::UART7_TX << DMA_SxCR_CHSEL_Pos) |	// uint32_t controlRegister1
	(define::dma::burst::SINGLE << DMA_SxCR_MBURST_Pos) | 
	(define::dma::burst::SINGLE << DMA_SxCR_PBURST_Pos) | 
	(define::dma::priorityLevel::LOW << DMA_SxCR_PL_Pos) |
	(define::dma::size::BYTE << DMA_SxCR_MSIZE_Pos) |
	(define::dma::size::BYTE << DMA_SxCR_PSIZE_Pos) |
	DMA_SxCR_MINC_Msk | 
	(define::dma::dir::MEM_TO_PERI << DMA_SxCR_DIR_Pos) | 
	DMA_SxCR_TCIE_Msk | 
	DMA_SxCR_TEIE_Msk | 
	DMA_SxCR_EN_Msk ,
	DMA_SxFCR_DMDIS_Msk,			// uint32_t controlRegister2
	0,								// uint32_t controlRegister3
#if defined(STM32F7)
	(void*)&UART7->TDR,			//void *dataRegister;
#else
	(void*)&UART7->DR,						//void *dataRegister;
#endif
};

static const Uart::setup_t gUart7Setup
{
	UART7,			//YSS_SPI_Peri *peri;
	dmaChannel2,	//Dma &txDma;
	gUart7TxDmaInfo	//Dma::DmaInfo txDmaInfo;
};

Uart uart7(gDrvUart7Setup, gUart7Setup);

extern "C"
{
	void YSS_UART7_IRQHandler(void)
	{
		uart7.isr();
	}
}
#endif



#if (defined(UART8) || defined(USART8)) && UART8_ENABLE
static void enableUart8Clock(bool en)
{
	clock.lock();
	clock.enableApb1Clock(RCC_APB1ENR_UART8EN_Pos, en);
	clock.unlock();
}

static void enableUart8Interrupt(bool en)
{
	nvic.lock();
	nvic.enableInterrupt(UART8_IRQn, en);
	nvic.unlock();
}

static void resetUart8(void)
{
	clock.lock();
	clock.resetApb1(RCC_APB1RSTR_UART7RST_Pos);
	clock.unlock();
}

static const Drv::setup_t gDrvUart8Setup
{
	enableUart8Clock,		//void (*clockFunc)(bool en);
	enableUart8Interrupt,	//void (*nvicFunc)(bool en);
	resetUart8,				//void (*resetFunc)(void);
	getApb1ClockFrequency	//uint32_t (*getClockFunc)(void);
};

static const Dma::DmaInfo gUart8TxDmaInfo = 
{
	(define::dma1::stream0::UART8_TX << DMA_SxCR_CHSEL_Pos) |	// uint32_t controlRegister1
	(define::dma::burst::SINGLE << DMA_SxCR_MBURST_Pos) | 
	(define::dma::burst::SINGLE << DMA_SxCR_PBURST_Pos) | 
	(define::dma::priorityLevel::LOW << DMA_SxCR_PL_Pos) |
	(define::dma::size::BYTE << DMA_SxCR_MSIZE_Pos) |
	(define::dma::size::BYTE << DMA_SxCR_PSIZE_Pos) |
	DMA_SxCR_MINC_Msk | 
	(define::dma::dir::MEM_TO_PERI << DMA_SxCR_DIR_Pos) | 
	DMA_SxCR_TCIE_Msk | 
	DMA_SxCR_TEIE_Msk | 
	DMA_SxCR_EN_Msk ,
	DMA_SxFCR_DMDIS_Msk,			// uint32_t controlRegister2
	0,								// uint32_t controlRegister3
#if defined(STM32F7)
	(void*)&UART8->TDR,			//void *dataRegister;
#else
	(void*)&UART8->DR,						//void *dataRegister;
#endif
};

static const Uart::setup_t gUart8Setup
{
	UART8,			//YSS_SPI_Peri *peri;
	dmaChannel1,	//Dma &txDma;
	gUart8TxDmaInfo	//Dma::DmaInfo txDmaInfo;
};

Uart uart8(gDrvUart8Setup, gUart8Setup);

extern "C"
{
	void YSS_UART8_IRQHandler(void)
	{
		uart8.isr();
	}
}
#endif



#if defined(STM32F030xC)
extern "C"
{
	void USART3_6_IRQHandler(void)
	{
#if defined(USART3) && USART3_ENABLE
		if(USART3->ISR & (USART_ISR_RXNE_Msk | USART_ISR_FE_Msk | USART_ISR_ORE_Msk | USART_ISR_FE_Msk))
			usart3.isr();
#endif
#if (defined(UART4) || defined(USART4)) && USART4_ENABLE
		if(USART4->ISR & (USART_ISR_RXNE_Msk | USART_ISR_FE_Msk | USART_ISR_ORE_Msk | USART_ISR_FE_Msk))
			usart4.isr();
#endif
#if (defined(UART5) || defined(USART5)) && USART5_ENABLE
		if(USART5->ISR & (USART_ISR_RXNE_Msk | USART_ISR_FE_Msk | USART_ISR_ORE_Msk | USART_ISR_FE_Msk))
			usart5.isr();
#endif
#if defined(USART6) && USART6_ENABLE
		if(USART6->ISR & (USART_ISR_RXNE_Msk | USART_ISR_FE_Msk | USART_ISR_ORE_Msk | USART_ISR_FE_Msk))
			usart6.isr();
#endif
	}
}
#endif

#endif

